In [1]:
# time series is a data set where values are measured at different points in time

In [2]:
import pandas as pd

In [3]:
my_data = pd.read_csv("IMDB-Movie-Data.csv")
my_data.head(4)

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0

In [4]:
# read data types
my_data.dtypes

Rank                    int64
Title                  object
Genre                  object
Description            object
Director               object
Actors                 object
Year                    int64
Runtime (Minutes)       int64
Rating                float64
Votes                   int64
Revenue (Millions)    float64
Metascore             float64
dtype: object

In [5]:
# read years 
my_data[["Year"]]

     Year
0    2014
1    2012
2    2016
3    2016
4    2016
..    ...
995  2015
996  2007
997  2008
998  2014
999  2016

[1000 rows x 1 columns]

In [6]:
# read runtime 
my_data[["Runtime (Minutes)"]]

     Runtime (Minutes)
0                  121
1                  124
2                  117
3                  108
4                  123
..                 ...
995                111
996                 94
997                 98
998                 93
999                 87

[1000 rows x 1 columns]

In [7]:
# my_data = my_data.set_index("Year")
my_data

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
996,997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
997,998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [8]:
my_dataframe = my_data[['Year', 'Director', 'Genre', 'Rating']]

In [9]:
my_dataframe = my_dataframe.set_index('Year')
my_dataframe

                  Director                     Genre  Rating
Year
2014            James Gunn   Action,Adventure,Sci-Fi     8.1
2012          Ridley Scott  Adventure,Mystery,Sci-Fi     7.0
2016    M. Night Shyamalan           Horror,Thriller     7.3
2016  Christophe Lourdelet   Animation,Comedy,Family     7.2
2016            David Ayer  Action,Adventure,Fantasy     6.2
...                    ...                       ...     ...
2015             Billy Ray       Crime,Drama,Mystery     6.2
2007              Eli Roth                    Horror     5.5
2008            Jon M. Chu       Drama,Music,Romance     6.2
2014        Scot Armstrong          Adventure,Comedy     5.6
2016      Barry Sonnenfeld     Comedy,Family,Fantasy     5.3

[1000 rows x 3 columns]

In [10]:
# print time series 
my_dataframe.index

Int64Index([2014, 2012, 2016, 2016, 2016, 2016, 2016, 2016, 2016, 2016,
            ...
            2009, 2007, 2011, 2010, 2012, 2015, 2007, 2008, 2014, 2016],
           dtype='int64', name='Year', length=1000)

In [11]:
#check data type
my_dataframe.dtypes

Director     object
Genre        object
Rating      float64
dtype: object

In [12]:
# change type of year to date
# my_dataframe["Year"] = my_dataframe.index.year

In [13]:
# get 5 samples from dataset
my_dataframe.sample((5, random_state=0))

SyntaxError: invalid syntax (<ipython-input-13-88cded9f2fcd>, line 2)